Repository: kscanne/gramadoir
Catalog: po/*.po
Languages: fi

source: There was %d error.
fi: Virheitä oli %d.

source: Successfully parsed %d rule.
fi: Jäsennetty %d sääntö onnistuneesti.

source: Line %d: %s
fi: Rivi %d: %s

source: unrecognized option %s
fi: tunnistamaton valitsin %s

source: option %s requires an argument
fi: valitsin %s vaatii argumentin

source: option %s does not allow an argument
fi: valitsin %s ei salli argumenttia

source: error parsing command-line options
fi: virhe jäsennettäessä komentorivivalitsimia

source: Unable to set output color to %s
fi: Tulostevärin %s asettaminen epäonnistui

source: Language %s is not supported.
fi: Kieltä %s ei tueta.

source: An Gramadoir
fi: Gramadóir

source: Try %s for more information.
fi: Lisätietoja komennolla %s.

source: version %s
fi: versio %s

source: This is free software; see the source for copying conditions. There is NO\nwarranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE,\nto the extent permitted by law.
fi: Tämä on vapaa ohjelmisto; katso lähdekoodista kopiointiehdot. Ohjelmalle EI\nole takuuta; ei edes KAUPALLISUUDELLE tai SOPIVUUDELLE TIETTYYN TARKOITUKSEEN,\nsiinä laajudessa minkä laki sallii.

source: Usage: %s [OPTIONS] [FILES]
fi: Käyttö: %s [VALITSIMET] [TIEDOSTOT]

source: Options for end-users:
fi: Loppukäyttäjän valitsimet:

source: --iomlan report all errors (i.e. do not use ~/.neamhshuim)
fi: --iomlan ilmoita kaikki virheet (ts. älä käytä tiedostoa ~/.neamhshuim)

source: --ionchod=ENC specify the character encoding of the text to be checked
fi: --ionchod=ENC määritä tarkistettavan tekstin merkkikoodaus

source: --aschod=ENC specify the character encoding for output
fi: --aschod=ENC määritä tulosteen merkkikoodaus

source: --comheadan=xx choose the language for error messages
fi: --comheadan=xx valitse virheilmoitusten kieli

source: --dath=COLOR specify the color to use for highlighting errors
fi: --dath=VÄRI määritä väri virheiden korostamiseen

source: --litriu write misspelled words to standard output
fi: --litriu kirjoita väärinkirjoitetut sanat vakiotulosteeseen

source: --aspell suggest corrections for misspellings
fi: --aspell suosittele korjauksia väärinkirjoituksiin

source: --aschur=FILE write output to FILE
fi: --aschur=FILE kirjoita tuloste tiedostoon FILE

source: --help display this help and exit
fi: --help näytä tämä opaste ja poistu

source: --version output version information and exit
fi: --version tulosta versiotiedot ja poistu

source: Options for developers:
fi: Valitsimet kehittäjille:

source: --api output a simple XML format for use with other applications
fi: --api tulosta yksinkertainen XML-muoto muiden sovellusten käyttöön

source: --html produce HTML output for viewing in a web browser
fi: --html tuota HTML-tuloste webbiselaimelle

source: --no-unigram do not resolve ambiguous parts of speech by frequency
fi: --no-unigram älä ratkaise monimerkityksellisiä puheen osia esiintymistaajuuden avulla

source: --xml write tagged XML stream to standard output, for debugging
fi: --xml kirjoita tunnisteilla varustettu XML-vuo vakiotulosteeseen vianjäljitystarkoituksiin

source: If no file is given, read from standard input.
fi: Luetaan vakiosyötteestä jos tiedostoa ei ole annettu.

source: Send bug reports to <%s>.
fi: Ilmoita virheistä (englanniksi) osoitteeseen <%s>. Ilmoita käännösvirheistä osoitteeseen <translation-team-fi@lists.sourceforge.net>.

source: There is no such file.
fi: Tiedostoa ei löydy.

source: Is a directory
fi: On hakemisto

source: Permission denied
fi: Ei oikeuksia

source: %s: warning: problem closing %s
fi: %s: varoitus: pulma suljettaessa %s

source: Currently checking %s
fi: Parhaillaan tarkistetaan %s

source: --ilchiall report unresolved ambiguities, sorted by frequency
fi: --ilchiall ilmoita ratkaisemattomista monimerkityksellisyyksistä esiintymistaajuuden mukaan lajiteltuna

source: --minic output all tags, sorted by frequency (for unigram-xx.txt)
fi: --minic tulosta kaikki tunnisteet, lajiteltu taajuuden mukaan (tiedostoa unigram-xx.txt varten)

source: --brill find disambiguation rules via Brill's unsupervised algorithm
fi: --brill löydä yksimerkitykselliset säännöt Brillin ohjaamattoman algoritmin kautta

source: %s: problem reading the database
fi: %s: pulma luettaessa tietokantaa

source: %s: `%s' corrupted at %s
fi: %s: `%s' rikkoutunut osoitteessa %s

source: conversion from %s is not supported
fi: muunnosta kohteesta %s ei tueta

source: %s: illegal grammatical code
fi: %s: virheellinen kieliopillinen koodi

source: %s: no grammar codes: %s
fi: %s: ei kielioppikoodeja: %s

source: %s: unrecognized error macro: %s
fi: %s: tunnistamaton virhemakro: %s

source: Valid word but extremely rare in actual usage. Is this the word you want?
fi: Kelvollinen sana, mutta äärimmäisen harvinainen todellisessa käytössä. Onko tämä sana, jota haluat?

source: Repeated word
fi: Toistettu sana

source: Unusual combination of words
fi: Epätavallinen sanojen yhdistelmä

source: The plural form is required here
fi: Tässä vaaditaan monikkomuotoa

source: The singular form is required here
fi: Tässä vaaditaan yksikkömuotoa

source: Plural adjective required
fi: Vaaditaan monikollista adjektiivia

source: Comparative adjective required
fi: Vaaditaan vertailumuotoadjektiivia

source: Definite article required
fi: Vaaditaan määrättyä artikkelia

source: Unnecessary use of the definite article
fi: Määrätyn artikkelin tarpeeton käyttö

source: No need for the first definite article
fi: Ensimmäiselle määrätylle artikkelille ei ole tarvetta

source: Unnecessary use of the genitive case
fi: Genetiivimuodon tarpeeton käyttö

source: The genitive case is required here
fi: Tässä vaaditaan genetiivimuotoa

source: You should use the present tense here
fi: Tässä pitäisi käyttää preesensiä

source: It seems unlikely that you intended to use the subjunctive here
fi: Ei tunnu todennäköiseltä, että tarkoituksesi oli käyttää tässä subjunktiivia

source: Usually used in the set phrase \/\1\/
fi: Käytetään tavallisesti joukko-opin lauseessa \/\1\/

source: You should use \/\1\/ here instead
fi: Tässä pitäisi sen sijaan käyttää \/\1\/

source: Non-standard form of \/\1\/
fi: Epästandardi \/\1\/-muoto

source: Derived from a non-standard form of \/\1\/
fi: Periytyy epästandardista \/\1\/-muodosta

source: Derived incorrectly from the root \/\1\/
fi: Periytyy virheellisestä sanavartalosta \/\1\/

source: Unknown word
fi: Tuntematon sana

source: Unknown word: \/\1\/?
fi: Tuntematon sana: \/\1\/?

source: Valid word but \/\1\/ is more common
fi: Kelvollinen sana, mutta \/\1\/ on tavallisempi

source: Not in database but apparently formed from the root \/\1\/
fi: Ei tietokannassa, mutta ilmeisesti muodostettu sanavartalosta \/\1\/

source: The word \/\1\/ is not needed
fi: Sanaa \/\1\/ ei tarvita

source: Do you mean \/\1\/?
fi: Tarkoitatko \/\1\/?

source: Derived form of common misspelling \/\1\/?
fi: Periytyykö yleisestä väärinkirjoitetusta \/\1\/-muodosta?

source: Not in database but may be a compound \/\1\/?
fi: Ei tietokannassa, mutta saattaa olla yhdyssana \/\1\/?

source: Not in database but may be a non-standard compound \/\1\/?
fi: Ei tietokannassa, mutta saattaa olla epästandardi yhdyssana \/\1\/?

source: Possibly a foreign word (the sequence \/\1\/ is highly improbable)
fi: Mahdollisesti vierassana (sekvenssi \/\1\/ on hyvin epätodennäköinen)

source: Gender disagreement
fi: Sukuristiriita

source: Number disagreement
fi: Lukuristiriita

source: Case disagreement
fi: Sijamuotoristiriita

source: Prefix \/h\/ missing
fi: Etuliite \/h\/ puuttuu

source: Prefix \/t\/ missing
fi: Etuliite \/t\/ puuttuu

source: Prefix \/d'\/ missing
fi: Etuliite \/d'\/ puuttuu

source: Unnecessary prefix \/h\/
fi: Tarpeeton etuliite \/h\/

source: Unnecessary prefix \/t\/
fi: Tarpeeton etuliite \/t\/

source: Unnecessary prefix \/d'\/
fi: Tarpeeton etuliite \/d'\/

source: Unnecessary prefix \/b'\/
fi: Tarpeeton etuliite \/b'\/

source: Unnecessary initial mutation
fi: Turha alustava mutaatio

source: Initial mutation missing
fi: Alustava mutaatio puuttuu

source: Unnecessary lenition
fi: Turha liudentuminen

source: The second lenition is unnecessary
fi: Toinen liudentuminen on turha

source: Often the preposition \/\1\/ causes lenition, but this case is unclear
fi: Usein prepositio \/\1\/ aiheuttaa liudentumisen, mutta tämä tapaus on epäselvä

source: Lenition missing
fi: Liudentuminen puuttuu

source: Unnecessary eclipsis
fi: Tarpeeton elisio

source: Eclipsis missing
fi: Mykkä tavu puuttuu

source: The dative is used only in special phrases
fi: Datiivia käytetään vain erikoislauseissa

source: The dependent form of the verb is required here
fi: Tässä vaaditaan verbin säännöllinen muoto

source: Unnecessary use of the dependent form of the verb
fi: Säännöllisen verbin tarpeeton käyttö

source: The synthetic (combined) form, ending in \/\1\/, is often used here
fi: Synteettinen (yhdistetty) muoto, lopussa \/\1\/, käytetään usein täällä

source: Second (soft) mutation missing
fi: Toinen (pehmeä) mutaatio puuttuu

source: Third (breathed) mutation missing
fi: Kolmas (hengähdetty) mutaatio puuttuu

source: Fourth (hard) mutation missing
fi: Neljäs (kova) mutaatio puuttuu

source: Fifth (mixed) mutation missing
fi: Viides (sekoitettu) mutaatio puuttuu

source: Fifth (mixed) mutation after 'th missing
fi: Viides (sekoitettu) mutaatio 'th:n jälkeen puuttuu

source: Aspirate mutation missing
fi: aspiraattamutaatio puuttuu

source: This word violates the rules of Igbo vowel harmony
fi: Tämä sana rikkoo igbo-kielen vokaaliharmoniasääntöjä
